import { Link } from "react-router-dom";
import styles from "../../style";
const Legal = () => {
  return (
    // START LEGAL PAGE
    <section id="legal">
      <div className="container">
        <div className={`legal-hero ${styles.flexBetween} py-[65px]`}>
          <div className="hero-content">
            <h2 className="text-[35px] font-bold mb-[5px]">سياسة الخصوصية</h2>
            <span className="text-[#787878] text-[16px] font-bold">
              {" "}
              الرئيسية &gt;{" "}
              <span className="text-[var(--main-color)]">سياسة الخصوصية</span>
            </span>
            <h3 className="text-[18px] font-bold mt-[40px]">
              تعرف على سياسة موقعنا
            </h3>
            <p className="text-[#787878] text-[18px] leading-[1.8] mt-[5px] max-w-[620px]">
              قد نحتاج إلى محتوى عرض المعلومات الخاص بك على الموقع بشكل صحيح
              لتحسين موقعنا قد نستخدم التعليقات التي تقدمها لتحسين منتجاتنا
              وخدماتنا لإرسال رسائل البريد الإلكتروني الدورية .
            </p>
          </div>
        </div>
        <div className="legal-content">
          <h1 className="text-[18px] font-bold leading-[1.6]">
            معلومات الهوية الشخصية :
          </h1>
          <p className="text-[var(--paragraph-color)] text-[17px] font-semibold leading-[1.9] mt-[5px]">
            {" "}
            قد نقوم بجمع معلومات التعريف الشخصية من المستخدمين بطرق متنوعة ، بما
            في ذلك ، على سبيل المثال لا الحصر ، عندما يزور المستخدمون موقعنا ،
            ويسجلون على الموقع ، وفيما يتعلق بأنشطة أو خدمات أو ميزات أو موارد
            أخرى نوفرها على موقعنا . قد يطلب من المستخدمين ، عند الاقتضاء ،
            عنوان البريد الإلكتروني. ومع ذلك ، يمكن للمستخدمين زيارة موقعنا بشكل
            مجهول. سنقوم بجمع معلومات التعريف الشخصية من المستخدمين فقط إذا
            قاموا بتقديم هذه المعلومات إلينا طواعية. يمكن للمستخدمين دائمًا رفض
            تقديم معلومات التعريف الشخصية ، باستثناء أنها قد تمنعهم من المشاركة
            في أنشطة معينة متعلقة بالموقع .
          </p>
          <h1 className="text-[18px] font-bold leading-[1.6] mt-[15px]">
            معلومات تعريف غير شخصية :
          </h1>
          <p className="text-[var(--paragraph-color)] text-[17px] font-semibold leading-[1.9] mt-[5px]">
            قد نجمع معلومات تعريف غير شخصية عن المستخدمين كلما تفاعلوا مع
            موقعنا. قد تتضمن معلومات التعريف غير الشخصية اسم المتصفح ونوع
            الكمبيوتر والمعلومات الفنية حول المستخدمين وسائل الاتصال بموقعنا ،
            مثل نظام التشغيل وموفري خدمة الإنترنت المستفيدين ومعلومات أخرى
            مماثلة.
          </p>
          <h1 className="text-[18px] font-bold leading-[1.6] mt-[15px]">
            ملفات تعريف ارتباط متصفح الويب :
          </h1>
          <p className="text-[var(--paragraph-color)] text-[17px] font-semibold leading-[1.9] mt-[5px]">
            قد يستخدم موقعنا “ملفات تعريف الارتباط” لتحسين تجربة المستخدم. يضع
            متصفح الويب للمستخدم ملفات تعريف الارتباط على محرك الأقراص الثابتة
            لأغراض حفظ السجلات ، وفي بعض الأحيان يتتبع المعلومات عنها. قد يختار
            المستخدم تعيين متصفح الويب الخاص به لرفض ملفات تعريف الارتباط ، أو
            لتنبيهك عند إرسال ملفات تعريف الارتباط. إذا قاموا بذلك ، فلاحظ أن
            بعض أجزاء الموقع قد لا تعمل بشكل صحيح.
          </p>
          <h1 className="text-[18px] font-bold leading-[1.6] mt-[15px]">
            كيف نحمي معلوماتك :
          </h1>
          <p className="text-[var(--paragraph-color)] text-[17px] font-semibold leading-[1.9] mt-[5px]">
            نحن نتبنى الممارسات المناسبة لجمع البيانات وتخزينها ومعالجتها
            وتدابير الأمن للحماية من الوصول غير المصرح به أو التغيير أو الإفصاح
            أو إتلاف معلوماتك الشخصية واسم المستخدم وكلمة المرور ومعلومات
            المعاملات والبيانات المخزنة على موقعنا.
          </p>
          <h1 className="text-[18px] font-bold leading-[1.6] mt-[15px]">
            تبادل المعلومات الشخصية الخاصة بك :
          </h1>
          <p className="text-[var(--paragraph-color)] text-[17px] font-semibold leading-[1.9] mt-[5px]">
            نحن لا نبيع أو نتاجر أو نؤجر معلومات التعريف الشخصية للمستخدمين
            للآخرين. قد نشارك معلومات ديموغرافية مجمعة عامة لا ترتبط بأي معلومات
            تعريف شخصية تتعلق بالزائرين والمستخدمين مع شركائنا في العمل والشركات
            التابعة الموثوقة والمعلنين للأغراض الموضحة أعلاه.
          </p>
          <h1 className="text-[18px] font-bold leading-[1.6] mt-[15px]">
            التغييرات على سياسة الخصوصية هذه :
          </h1>
          <p className="text-[var(--paragraph-color)] text-[17px] font-semibold leading-[1.9] mt-[5px]">
            تمتلك تيم سوفت السلطة التقديرية لتحديث سياسة الخصوصية هذه في أي وقت.
            عندما نفعل ذلك ، سنقوم بنشر إشعار على الصفحة الرئيسية لموقعنا ونرسل
            لك رسالة بريد إلكتروني. نشجع المستخدمين على التحقق من هذه الصفحة
            بشكل متكرر لمعرفة أي تغييرات للبقاء على اطلاع على كيفية قيامنا
            بالمساعدة في حماية المعلومات الشخصية التي نجمعها. أنت تقر وتوافق على
            أنه من مسؤوليتك مراجعة سياسة الخصوصية هذه بشكل دوري وأن تصبح على علم
            بالتعديلات.
          </p>
          <h1 className="text-[18px] font-bold leading-[1.6] mt-[15px]">
            اذا كان لديك أي أسئلة حول سياسة الخصوصية هذه ، أو ممارسات هذا الموقع
            ، أو تعاملك مع هذا الموقع ، يرجى{" "}
            <Link to={"/contact"} className="text-[var(--main-color)]">
              الاتصال بنا
            </Link>{" "}
            .
          </h1>
        </div>
      </div>
    </section>
    // END LEGAL PAGE
  );
};

export default Legal;
